import math
import random

# Задача-1:
# Дан список заполненный произвольными целыми числами, получите новый список элементами которого будут
# квадратные корни элементов исходного списка, но только если результаты извлечения корня не имеют десятичной части и
# если такой корень вообще можно извлечь
# Пример: Дано: [2, -5, 8, 9, -25, 25, 4]   Результат: [3, 5, 2]
lst = [2, -5, 8, 9, -25, 25, 4]
lst1 = []
for i in lst:
    if i > 0 and math.sqrt(i) - int(math.sqrt(i)) == 0:
        lst1.append(int(math.sqrt(i)))


# Задача-2: Дана дата в формате dd.mm.yyyy, например: 02.11.2013.
# Ваша задача вывести дату в текстовом виде, например: второе ноября 2013 года.
# Склонением пренебречь (2000 года, 2010 года)
day = ['первое', 'второе', "третье", "и так далее"]
month = ['января', "февраля", "марта", "апреля", "мая", "июня", "июля",
         "августа", "сентября", "октября", "ноября", "декабря"]
date = "02.11.2013"
dateList = date.split(".")
print("{} {} {} года".format(day[int(dateList[0])-1], month[int(dateList[1])-1],
                             int(dateList[2])-1))

# Задача-3: Напишите алгоритм, заполняющий список произвольными целыми числами
# в диапазоне от -100 до 100. В списке должно быть n - элементов.
# Подсказка:
# для получения случайного числа используйте функцию randint() модуля random
n = int(input("Введите число n: "))
lst = []
for i in range(n+1):
    lst.append(random.randint(-100, 100))

# Задача-4: Дан список, заполненный произвольными целыми числами.
# Получите новый список, элементами которого будут:
# а) неповторяющиеся элементы исходного списка:
# например, lst = [1, 2, 4, 5, 6, 2, 5, 2], нужно получить lst2 = [1, 2, 4, 5, 6]
# б) элементы исходного списка, которые не имеют повторений:
# например, lst = [1 , 2, 4, 5, 6, 2, 5, 2], нужно получить lst2 = [1, 4, 6]

# Вариант а)
uLst = list(set(lst))

# Вариант б)
nrLst = []
for i in range(len(uLst)):
    if lst.count(uLst[i]) == 1:
        nrLst.append(uLst[i])
